---
kind: property
id: P:Autodesk.Revit.DB.CategoryNameMap.Size
source: html/d6d2360c-cc90-63f5-4abd-8a0d9315fdf5.htm
---
# Autodesk.Revit.DB.CategoryNameMap.Size Property

Returns the number of categories that are in the map.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```